{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Anwendung",
    "1": "Anzahl_Der_Einheiten",
    "2": "Besonderheiten",
    "3": "Breite",
    "4": "Bremsscheiben-Aussendurchmesser",
    "5": "Bremsscheibenart",
    "6": "Einbauposition",
    "7": "Farbe",
    "8": "Gr\u00f6\u00dfe",
    "9": "Hersteller",
    "10": "Herstellernummer",
    "11": "Herstellungsland_Und_-Region",
    "12": "Im_Lieferumfang_Enthalten",
    "13": "Kompatible_Fahrzeug_Marke",
    "14": "Kompatibles_Fahrzeug_Jahr",
    "15": "Kompatibles_Fahrzeug_Modell",
    "16": "L\u00e4nge",
    "17": "Material",
    "18": "Ma\u00dfeinheit",
    "19": "Menge",
    "20": "Modell",
    "21": "O",
    "22": "Oberfl\u00e4chenbeschaffenheit",
    "23": "Oe/Oem_Referenznummer(N)",
    "24": "Produktart",
    "25": "Produktlinie",
    "26": "SAE_Viskosit\u00e4t",
    "27": "St\u00e4rke",
    "28": "Technologie",
    "29": "Z\u00e4hnezahl"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Anwendung": 0,
    "Anzahl_Der_Einheiten": 1,
    "Besonderheiten": 2,
    "Breite": 3,
    "Bremsscheiben-Aussendurchmesser": 4,
    "Bremsscheibenart": 5,
    "Einbauposition": 6,
    "Farbe": 7,
    "Gr\u00f6\u00dfe": 8,
    "Hersteller": 9,
    "Herstellernummer": 10,
    "Herstellungsland_Und_-Region": 11,
    "Im_Lieferumfang_Enthalten": 12,
    "Kompatible_Fahrzeug_Marke": 13,
    "Kompatibles_Fahrzeug_Jahr": 14,
    "Kompatibles_Fahrzeug_Modell": 15,
    "L\u00e4nge": 16,
    "Material": 17,
    "Ma\u00dfeinheit": 18,
    "Menge": 19,
    "Modell": 20,
    "O": 21,
    "Oberfl\u00e4chenbeschaffenheit": 22,
    "Oe/Oem_Referenznummer(N)": 23,
    "Produktart": 24,
    "Produktlinie": 25,
    "SAE_Viskosit\u00e4t": 26,
    "St\u00e4rke": 27,
    "Technologie": 28,
    "Z\u00e4hnezahl": 29
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.1.0",
  "use_cache": false,
  "vocab_size": 28996
}
